#### 📖 Terraform Plan ('infra/prod') - success
<details>
<summary>Terraform Plan</summary>

```hcl

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.key_vault.azurerm_key_vault_secret.bo_auth_session_secret has changed
  ~ resource "azurerm_key_vault_secret" "bo_auth_session_secret" {
        id                      = "https://io-p-itn-svc-kv.vault.azure.net/secrets/bo-auth-session-secret/3a746fb903004304a13d73153a7f0a6c"
        name                    = "bo-auth-session-secret"
        tags                    = {}
      ~ value                   = (sensitive value)
        # (7 unchanged attributes hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.key_vault.azurerm_key_vault_secret.bo_auth_session_secret will be updated in-place
  ~ resource "azurerm_key_vault_secret" "bo_auth_session_secret" {
        id                      = "https://io-p-itn-svc-kv.vault.azure.net/secrets/bo-auth-session-secret/3a746fb903004304a13d73153a7f0a6c"
        name                    = "bo-auth-session-secret"
        tags                    = {}
      ~ value                   = (sensitive value)
        # (7 unchanged attributes hidden)
    }

  # module.backoffice.module.backoffice.azurerm_linux_web_app.this will be updated in-place
  ~ resource "azurerm_linux_web_app" "this" {
      ~ app_settings                                   = {
          ~ "NEXTAUTH_SECRET"                                 = (sensitive value)
            # (46 unchanged elements hidden)
        }
        id                                             = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-svc-rg-01/providers/Microsoft.Web/sites/io-p-itn-svc-bo-app-01"
        name                                           = "io-p-itn-svc-bo-app-01"
        tags                                           = {
            "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO Enti & Servizi"
            "Owner"          = "IO"
            "Source"         = "https://github.com/pagopa/io-services-cms/infra/prod/italynorth"
        }
        # (21 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.backoffice.module.backoffice.azurerm_linux_web_app_slot.this[0] must be replaced
-/+ resource "azurerm_linux_web_app_slot" "this" {
      ~ app_metadata                                   = {} -> (known after apply)
      ~ custom_domain_verification_id                  = (sensitive value)
      ~ default_hostname                               = "io-p-itn-svc-bo-app-01-io-p-itn-svc-bo-staging-app-01.azurewebsites.net" -> (known after apply)
      + hosting_environment_id                         = (known after apply)
      ~ id                                             = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-svc-rg-01/providers/Microsoft.Web/sites/io-p-itn-svc-bo-app-01/slots/io-p-itn-svc-bo-staging-app-01" -> (known after apply)
      ~ key_vault_reference_identity_id                = "SystemAssigned" -> (known after apply)
      ~ kind                                           = "app,linux" -> (known after apply)
      ~ name                                           = "io-p-itn-svc-bo-staging-app-01" -> "staging" # forces replacement
      ~ outbound_ip_address_list                       = [
          - "4.232.8.33",
          - "4.232.9.59",
          - "4.232.9.61",
          - "4.232.9.45",
          - "4.232.9.63",
          - "4.232.9.80",
          - "4.232.99.1",
        ] -> (known after apply)
      ~ outbound_ip_addresses                          = "4.232.8.33,4.232.9.59,4.232.9.61,4.232.9.45,4.232.9.63,4.232.9.80,4.232.99.1" -> (known after apply)
      ~ possible_outbound_ip_address_list              = [
          - "4.232.9.126",
          - "4.232.9.127",
          - "4.232.9.205",
          - "4.232.9.206",
          - "4.232.9.90",
          - "4.232.9.91",
          - "4.232.8.208",
          - "4.232.8.254",
          - "4.232.9.117",
          - "4.232.9.32",
          - "4.232.9.34",
          - "4.232.9.49",
          - "4.232.9.51",
          - "4.232.9.4",
          - "4.232.9.113",
          - "4.232.9.192",
          - "4.232.9.194",
          - "4.232.9.56",
          - "4.232.8.33",
          - "4.232.9.59",
          - "4.232.9.61",
          - "4.232.9.45",
          - "4.232.9.63",
          - "4.232.9.80",
          - "4.232.9.126",
          - "4.232.9.127",
          - "4.232.9.205",
          - "4.232.9.206",
          - "4.232.9.90",
          - "4.232.9.91",
          - "4.232.9.83",
          - "4.232.9.85",
          - "4.232.9.87",
          - "4.232.9.121",
          - "4.232.9.123",
          - "4.232.9.89",
          - "4.232.99.1",
        ] -> (known after apply)
      ~ possible_outbound_ip_addresses                 = "4.232.9.126,4.232.9.127,4.232.9.205,4.232.9.206,4.232.9.90,4.232.9.91,4.232.8.208,4.232.8.254,4.232.9.117,4.232.9.32,4.232.9.34,4.232.9.49,4.232.9.51,4.232.9.4,4.232.9.113,4.232.9.192,4.232.9.194,4.232.9.56,4.232.8.33,4.232.9.59,4.232.9.61,4.232.9.45,4.232.9.63,4.232.9.80,4.232.9.126,4.232.9.127,4.232.9.205,4.232.9.206,4.232.9.90,4.232.9.91,4.232.9.83,4.232.9.85,4.232.9.87,4.232.9.121,4.232.9.123,4.232.9.89,4.232.99.1" -> (known after apply)
      ~ site_credential                                = (sensitive value)
        tags                                           = {
            "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO Enti & Servizi"
            "Owner"          = "IO"
            "Source"         = "https://github.com/pagopa/io-services-cms/infra/prod/italynorth"
        }
      + zip_deploy_file                                = (known after apply)
        # (11 unchanged attributes hidden)

      ~ identity {
          - identity_ids = [] -> null
          ~ principal_id = "b2e17813-672e-445a-bae7-fe608587bb3c" -> (known after apply)
          ~ tenant_id    = "7788edaf-0346-4068-9d79-c868aed15b3d" -> (known after apply)
            # (1 unchanged attribute hidden)
        }

      ~ site_config {
          - auto_heal_enabled                       = false -> null
          ~ default_documents                       = [
              - "Default.htm",
              - "Default.html",
              - "Default.asp",
              - "index.htm",
              - "index.html",
              - "iisstart.htm",
              - "default.aspx",
              - "index.php",
              - "hostingstart.html",
            ] -> (known after apply)
          ~ detailed_error_logging_enabled          = false -> (known after apply)
          ~ linux_fx_version                        = "NODE|18-lts" -> (known after apply)
          ~ remote_debugging_version                = "VS2022" -> (known after apply)
          ~ scm_type                                = "None" -> (known after apply)
          ~ worker_count                            = 1 -> (known after apply)
            # (18 unchanged attributes hidden)

          ~ application_stack {
              + docker_registry_password = (sensitive value)
              + docker_registry_url      = (known after apply)
              + docker_registry_username = (known after apply)
                # (1 unchanged attribute hidden)
            }
        }
    }

  # module.backoffice.module.backoffice.azurerm_private_endpoint.staging_app_service_sites[0] must be replaced
-/+ resource "azurerm_private_endpoint" "staging_app_service_sites" {
      ~ custom_dns_configs       = [] -> (known after apply)
      ~ id                       = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-svc-rg-01/providers/Microsoft.Network/privateEndpoints/io-p-itn-svc-bo-staging-app-pep-01" -> (known after apply)
        name                     = "io-p-itn-svc-bo-staging-app-pep-01"
      ~ network_interface        = [
          - {
              - id   = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-svc-rg-01/providers/Microsoft.Network/networkInterfaces/io-p-itn-svc-bo-staging-app-pep-01.nic.fc645dc4-36b1-4e6a-8344-7661d0531c9a"
              - name = "io-p-itn-svc-bo-staging-app-pep-01.nic.fc645dc4-36b1-4e6a-8344-7661d0531c9a"
            },
        ] -> (known after apply)
      ~ private_dns_zone_configs = [
          - {
              - id                  = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-svc-rg-01/providers/Microsoft.Network/privateEndpoints/io-p-itn-svc-bo-staging-app-pep-01/privateDnsZoneGroups/private-dns-zone-group/privateDnsZoneConfigs/privatelink.azurewebsites.net"
              - name                = "privatelink.azurewebsites.net"
              - private_dns_zone_id = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-common/providers/Microsoft.Network/privateDnsZones/privatelink.azurewebsites.net"
              - record_sets         = [
                  - {
                      - fqdn         = "io-p-itn-svc-bo-app-01-io-p-itn-svc-bo-staging-app-01.privatelink.azurewebsites.net"
                      - ip_addresses = [
                          - "10.20.2.55",
                        ]
                      - name         = "io-p-itn-svc-bo-app-01-io-p-itn-svc-bo-staging-app-01"
                      - ttl          = 10
                      - type         = "A"
                    },
                  - {
                      - fqdn         = "io-p-itn-svc-bo-app-01-io-p-itn-svc-bo-staging-app-01.scm.privatelink.azurewebsites.net"
                      - ip_addresses = [
                          - "10.20.2.55",
                        ]
                      - name         = "io-p-itn-svc-bo-app-01-io-p-itn-svc-bo-staging-app-01.scm"
                      - ttl          = 10
                      - type         = "A"
                    },
                ]
            },
        ] -> (known after apply)
        tags                     = {
            "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO Enti & Servizi"
            "Owner"          = "IO"
            "Source"         = "https://github.com/pagopa/io-services-cms/infra/prod/italynorth"
        }
        # (3 unchanged attributes hidden)

      ~ private_dns_zone_group {
          ~ id                   = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-svc-rg-01/providers/Microsoft.Network/privateEndpoints/io-p-itn-svc-bo-staging-app-pep-01/privateDnsZoneGroups/private-dns-zone-group" -> (known after apply)
            name                 = "private-dns-zone-group"
            # (1 unchanged attribute hidden)
        }

      ~ private_service_connection {
            name                           = "io-p-itn-svc-bo-staging-app-pep-01"
          ~ private_ip_address             = "10.20.2.55" -> (known after apply)
          ~ subresource_names              = [ # forces replacement
              - "sites-io-p-itn-svc-bo-staging-app-01",
              + "sites-staging",
            ]
            # (2 unchanged attributes hidden)
        }
    }

  # module.cms_function_app.module.cms_fn.azurerm_linux_function_app.this will be updated in-place
  ~ resource "azurerm_linux_function_app" "this" {
      ~ app_settings                                   = {
          + "APPINSIGHTS_INSTRUMENTATIONKEY"                        = (sensitive value)
            # (91 unchanged elements hidden)
        }
        id                                             = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-svc-rg-01/providers/Microsoft.Web/sites/io-p-itn-svc-cms-func-01"
        name                                           = "io-p-itn-svc-cms-func-01"
        tags                                           = {
            "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO Enti & Servizi"
            "Owner"          = "IO"
            "Source"         = "https://github.com/pagopa/io-services-cms/infra/prod/italynorth"
        }
        # (26 unchanged attributes hidden)

      ~ site_config {
          - application_insights_key                = (sensitive value) -> null
          ~ health_check_eviction_time_in_min       = 0 -> 2
            # (25 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }

      ~ sticky_settings {
          ~ app_setting_names       = [
                "SLOT_TASK_HUBNAME",
              + "APPINSIGHTS_SAMPLING_PERCENTAGE",
              + "AzureFunctionsWebHost__hostid",
                "AzureWebJobs.LegacyServiceWatcher.Disabled",
                # (16 unchanged elements hidden)
            ]
            # (1 unchanged attribute hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.cms_function_app.module.cms_fn.azurerm_linux_function_app_slot.this[0] will be updated in-place
  ~ resource "azurerm_linux_function_app_slot" "this" {
      ~ app_settings                                   = {
          + "APPINSIGHTS_INSTRUMENTATIONKEY"                        = (sensitive value)
          - "APPINSIGHTS_SAMPLING_PERCENTAGE"                       = "5" -> null
            # (91 unchanged elements hidden)
        }
        id                                             = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-svc-rg-01/providers/Microsoft.Web/sites/io-p-itn-svc-cms-func-01/slots/staging"
        name                                           = "staging"
        tags                                           = {
            "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO Enti & Servizi"
            "Owner"          = "IO"
            "Source"         = "https://github.com/pagopa/io-services-cms/infra/prod/italynorth"
        }
        # (22 unchanged attributes hidden)

      ~ site_config {
          - application_insights_key                = (sensitive value) -> null
          ~ health_check_eviction_time_in_min       = 0 -> 2
            # (25 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.function_app.module.app_be_fn.azurerm_linux_function_app.this will be updated in-place
  ~ resource "azurerm_linux_function_app" "this" {
        id                                             = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-svc-rg-01/providers/Microsoft.Web/sites/io-p-itn-svc-app-be-func-01"
        name                                           = "io-p-itn-svc-app-be-func-01"
        tags                                           = {
            "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO Enti & Servizi"
            "Owner"          = "IO"
            "Source"         = "https://github.com/pagopa/io-services-cms/infra/prod/italynorth"
        }
        # (27 unchanged attributes hidden)

      ~ sticky_settings {
          ~ app_setting_names       = [
                "SLOT_TASK_HUBNAME",
              + "APPINSIGHTS_SAMPLING_PERCENTAGE",
              + "AzureFunctionsWebHost__hostid",
            ]
            # (1 unchanged attribute hidden)
        }

        # (2 unchanged blocks hidden)
    }

  # module.function_app.module.app_be_fn.azurerm_linux_function_app_slot.this[0] will be updated in-place
  ~ resource "azurerm_linux_function_app_slot" "this" {
      ~ app_settings                                   = {
          ~ "APPINSIGHTS_SAMPLING_PERCENTAGE"                 = "5" -> "100"
            # (16 unchanged elements hidden)
        }
        id                                             = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-svc-rg-01/providers/Microsoft.Web/sites/io-p-itn-svc-app-be-func-01/slots/staging"
        name                                           = "staging"
        tags                                           = {
            "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO Enti & Servizi"
            "Owner"          = "IO"
            "Source"         = "https://github.com/pagopa/io-services-cms/infra/prod/italynorth"
        }
        # (22 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

Plan: 2 to add, 6 to change, 2 to destroy.

Warning: Argument is deprecated

  with module.ai_search.module.srch_snet.azurerm_subnet.this,
  on .terraform/modules/ai_search.srch_snet/subnet/main.tf line 23, in resource "azurerm_subnet" "this":
  23:   private_endpoint_network_policies_enabled     = var.private_endpoint_network_policies_enabled

`private_endpoint_network_policies_enabled` will be removed in favour of the
property `private_endpoint_network_policies` in version 4.0 of the AzureRM
Provider

(and 3 more similar warnings elsewhere)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>
